"""
Chapter : 4 - item : 2 - คอยนาน
จำลองการเลื่อนแถวคอยภายในเวลาที่กำหนดโดยใช้ class queue โดยที่มีแถวหลัก 1 แถวยาวกี่คนก็ได้
แถวหน้า cashier 1 ยาว 5 คน โดยที่คนนี้จะใช้เวลา 3 นาทีในการคิดค่าบริการ
แถวหน้า cashier 2 ยาว 5 คน โดยที่คนนี้จะใช้เวลา 2 นาทีในการคิดค่าบริการ
ลูกค้าจะ move แถวทุกๆ 1 นาที โดยหากแถว 1 ว่างจะไปก่อนหากเต็มจึงไปแถว 2
จงแสดง นาที [แถวหลัก] [แถว cashier 1] [แถว cashier 2] จนกว่าแถวหลักจะหมด
    Testcase : #1
        Enter people : Lorem_Ipsum
        1 ['o', 'r', 'e', 'm', '_', 'I', 'p', 's', 'u', 'm'] ['L'] []
        2 ['r', 'e', 'm', '_', 'I', 'p', 's', 'u', 'm'] ['L', 'o'] []
        3 ['e', 'm', '_', 'I', 'p', 's', 'u', 'm'] ['L', 'o', 'r'] []
        4 ['m', '_', 'I', 'p', 's', 'u', 'm'] ['o', 'r', 'e'] []
        5 ['_', 'I', 'p', 's', 'u', 'm'] ['o', 'r', 'e', 'm'] []
        6 ['I', 'p', 's', 'u', 'm'] ['o', 'r', 'e', 'm', '_'] []
        7 ['p', 's', 'u', 'm'] ['r', 'e', 'm', '_', 'I'] []
        8 ['s', 'u', 'm'] ['r', 'e', 'm', '_', 'I'] ['p']
        9 ['u', 'm'] ['r', 'e', 'm', '_', 'I'] ['p', 's']
        10 ['m'] ['e', 'm', '_', 'I', 'u'] ['s']
        11 [] ['e', 'm', '_', 'I', 'u'] ['s', 'm']
"""
